LEXICON_RU: dict[str, str] = {
    "start_answer": "Добро пожаловать! Вы внутри панели управления ботом для заметок, "
    "для получения инструкции используйте команду /help",
    "help_answer": "Это бот для заметок, написанный @kAzaKed "
    "в рамках тестового задания. Этот бот может:\n-Создавать заметку, "
    "которая уведомит вас за 10 минут до назначенного времени\n-Показывать "
    "список имеющихся заметок\nА также перед началом работы с ним проводит "
    "регистрацию пользователя.\n\nДля удобства использования, интерфейс бота "
    "заключен в специальные кнопки - используйте их нажав на значок слева от скрепки "
    "на строке ввода.\n\nПриятного пользования!",
    "name_request": "Добро пожаловать в бота для заметок, "
    "для его использования нужно зарегистрироваться\n\n"
    "Пожалуйста введите ваше имя:",
    "setting_name_answer": "Имя введено успешно\n\n" "Пожалуйста введите вашу почту:",
    "compliting_registration_answer": "Вы успешно завершили регистрацию и "
    "попали в панель управления ботом для заметок\n\nДобро пожаловать!\n\n"
    "Для получения инструкции используйте команду /help",
    "show_notes_answer": "Ваши заметки:",
    "create_note_answer": "Введите текст заметки",
    "set_note_text_answer": "Теперь введите время напоминания о заметке в формате:"
    "YYYY-MM-DD HH:MM:SS\n\nЕсли вы введете время в неправильном формате, то не "
    "получите уведомление о заметке",
    "finish_creating_note_answer": "Заметка успешно создана!\n\n"
    "Вы получите уведомление за 10 минут до назначенного времени",
    "other_answer": "Пожалуйста, введите корректное сообщение\n"
    "Вы можете использовать кнопки интерфейса\n"
    "Для этого нажмите на значок справа на строке ввода\n\n"
    "Если считаете, что бот работает неисправно, то попробуйте "
    "ввести вручную команду /start, если это не поможет - напишите"
    " администратору @kAzaKed",
    "list_notes": "Список заметок",
    "cancel": "Назад",
    "create_note": "Создать заметку",
    "canceled_registration": "Регистрация отменена\n\n"
    "Чтобы пройти регистрацию заново, используйте команду /start",
    "canceled_creating_note": "Создание заметки отменено",
    "start_bot_error": "Ошибка при начале работы с ботом, попробуйте "
    "еще раз или сообщите об ошибке @kAzaKed",
    "setting_name_error": "Ошибка при введении имени при регистрации, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "setting_email_error": "Ошибка при завершении регистрации, "
    "попробуйте ввести почту еще раз или сообщите об ошибке @kAzaKed",
    "registration_cancel_error": "Ошибка при отмене регистрации, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "help_error": "Ошибка при получении инструкции, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "showing_notes_error": "Ошибка при получении списка заметок, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "create_note_error": "Ошибка при создании заметки, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "set_note_text_error": "Ошибка при вводе текста заметки, "
    "возможно вы ввели время заметки в неправильном формате, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "creating_note_error": "Ошибка при отмене создания заметки, "
    "попробуйте еще раз или сообщите об ошибке @kAzaKed",
    "processing_incorrect_message_error": "Ошибка при обработке некорректного сообщения, "
    "сообщите об ошибке @kAzaKed",
}
